; domain
(define (domain drone)

    ;remove requirements that are not needed
    ;(:requirements :strips)

    (:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
        location - object
    )

    ; un-comment following line if constants are needed
    ;(:constants )

    (:predicates ;todo: define predicates here
        (visited ?x - location)
    )
    (:functions
        (x)
        (y)
        (z)
        (xl ?l - location)
        (yl ?l - location)
        (zl ?l - location)
        (battery-level)
        (battery-level-full)
        (min_x)
        (max_x)
        (min_y)
        (max_y)
        (min_z)
        (max_z)
    )

    (:action increase_x
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (<= (x) (- (max_x) 1))
        )
        :effect (and (increase (x) 1)
            (decrease (battery-level) 1)
        )
    )

    (:action decrease_x
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (>= (x) (+ (min_x) 1))
        )
        :effect (and (decrease (x) 1)
            (decrease (battery-level) 1)
        )
    )

    (:action increase_y
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (<= (y) (- (max_y) 1))
        )
        :effect (and (increase (y) 1)
            (decrease (battery-level) 1)
        )
    )
    (:action decrease_y
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (>= (y) (+ (min_y) 1))
        )
        :effect (and (decrease (y) 1)
            (decrease (battery-level) 1)
        )
    )

    (:action increase_z
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (<= (z) (- (max_z) 1))
        )
        :effect (and (increase (z) 1)
            (decrease (battery-level) 1)
        )
    )
    (:action decrease_z
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (>= (z) (+ (min_z) 1))
        )
        :effect (and (decrease (z) 1)
            (decrease (battery-level) 1)
        )
    )

    (:action visit
        :parameters (?l - location)
        :precondition (and
            (>= (battery-level) 1)
            (= (xl ?l) (x))
            (= (yl ?l) (y))
            (= (zl ?l) (z))
        )
        :effect (and (visited ?l)
            (decrease (battery-level) 1))
    )

    (:action recharge
        :parameters ()
        :precondition (and
            (= (x) 0)
            (= (y) 0)
            (= (z) 0)
        )
        :effect (and
            (assign (battery-level) (battery-level-full)))
    )

)

; problem
;;Instance with 2x9x1 points
(define (problem name) (:domain drone)
(:objects
x0y0z0 - location
x0y1z0 - location
x0y2z0 - location
x0y3z0 - location
x0y4z0 - location
x0y5z0 - location
x0y6z0 - location
x0y7z0 - location
x0y8z0 - location
x1y0z0 - location
x1y1z0 - location
x1y2z0 - location
x1y3z0 - location
x1y4z0 - location
x1y5z0 - location
x1y6z0 - location
x1y7z0 - location
x1y8z0 - location
)
(:init (= (x) 0) (= (y) 0) (= (z) 0)
 (= (min_x) 0)  (= (max_x) 2)
 (= (min_y) 0)  (= (max_y) 9)
 (= (min_z) 0)  (= (max_z) 1)
(= (xl x0y0z0) 0)
(= (yl x0y0z0) 0)
(= (zl x0y0z0) 0)
(= (xl x0y1z0) 0)
(= (yl x0y1z0) 1)
(= (zl x0y1z0) 0)
(= (xl x0y2z0) 0)
(= (yl x0y2z0) 2)
(= (zl x0y2z0) 0)
(= (xl x0y3z0) 0)
(= (yl x0y3z0) 3)
(= (zl x0y3z0) 0)
(= (xl x0y4z0) 0)
(= (yl x0y4z0) 4)
(= (zl x0y4z0) 0)
(= (xl x0y5z0) 0)
(= (yl x0y5z0) 5)
(= (zl x0y5z0) 0)
(= (xl x0y6z0) 0)
(= (yl x0y6z0) 6)
(= (zl x0y6z0) 0)
(= (xl x0y7z0) 0)
(= (yl x0y7z0) 7)
(= (zl x0y7z0) 0)
(= (xl x0y8z0) 0)
(= (yl x0y8z0) 8)
(= (zl x0y8z0) 0)
(= (xl x1y0z0) 1)
(= (yl x1y0z0) 0)
(= (zl x1y0z0) 0)
(= (xl x1y1z0) 1)
(= (yl x1y1z0) 1)
(= (zl x1y1z0) 0)
(= (xl x1y2z0) 1)
(= (yl x1y2z0) 2)
(= (zl x1y2z0) 0)
(= (xl x1y3z0) 1)
(= (yl x1y3z0) 3)
(= (zl x1y3z0) 0)
(= (xl x1y4z0) 1)
(= (yl x1y4z0) 4)
(= (zl x1y4z0) 0)
(= (xl x1y5z0) 1)
(= (yl x1y5z0) 5)
(= (zl x1y5z0) 0)
(= (xl x1y6z0) 1)
(= (yl x1y6z0) 6)
(= (zl x1y6z0) 0)
(= (xl x1y7z0) 1)
(= (yl x1y7z0) 7)
(= (zl x1y7z0) 0)
(= (xl x1y8z0) 1)
(= (yl x1y8z0) 8)
(= (zl x1y8z0) 0)
(= (battery-level) 25)
(= (battery-level-full) 25)
)
(:goal (and
(visited x0y0z0)
(visited x0y1z0)
(visited x0y2z0)
(visited x0y3z0)
(visited x0y4z0)
(visited x0y5z0)
(visited x0y6z0)
(visited x0y7z0)
(visited x0y8z0)
(visited x1y0z0)
(visited x1y1z0)
(visited x1y2z0)
(visited x1y3z0)
(visited x1y4z0)
(visited x1y5z0)
(visited x1y6z0)
(visited x1y7z0)
(visited x1y8z0)
(= (x) 0) (= (y) 0) (= (z) 0) ))
);; end of the problem instance

; plan
1. (increase_y)
   changed: (y) from 0 to 1, (battery-level) from 25 to 24
   goals met: 2 of 21
2. (increase_y)
   changed: (y) from 1 to 2, (battery-level) from 24 to 23
   goals met: 2 of 21
3. (increase_y)
   changed: (y) from 2 to 3, (battery-level) from 23 to 22
   goals met: 2 of 21
4. (increase_y)
   changed: (y) from 3 to 4, (battery-level) from 22 to 21
   goals met: 2 of 21
5. (visit x0y4z0)
   added: (visited x0y4z0)
   changed: (battery-level) from 21 to 20
   goals met: 3 of 21
6. (increase_x)
   changed: (x) from 0 to 1, (battery-level) from 20 to 19
   goals met: 2 of 21
7. (visit x1y4z0)
   added: (visited x1y4z0)
   changed: (battery-level) from 19 to 18
   goals met: 3 of 21
8. (decrease_x)
   changed: (x) from 1 to 0, (battery-level) from 18 to 17
   goals met: 4 of 21
9. (decrease_y)
   changed: (y) from 4 to 3, (battery-level) from 17 to 16
   goals met: 4 of 21
10. (visit x0y3z0)
   added: (visited x0y3z0)
   changed: (battery-level) from 16 to 15
   goals met: 5 of 21
11. (increase_x)
   changed: (x) from 0 to 1, (battery-level) from 15 to 14
   goals met: 4 of 21
12. (visit x1y3z0)
   added: (visited x1y3z0)
   changed: (battery-level) from 14 to 13
   goals met: 5 of 21
13. (increase_y)
   changed: (y) from 3 to 4, (battery-level) from 13 to 12
   goals met: 5 of 21
14. (increase_y)
   changed: (y) from 4 to 5, (battery-level) from 12 to 11
   goals met: 5 of 21
15. (visit x1y5z0)
   added: (visited x1y5z0)
   changed: (battery-level) from 11 to 10
   goals met: 6 of 21
16. (decrease_x)
   changed: (x) from 1 to 0, (battery-level) from 10 to 9
   goals met: 7 of 21
17. (visit x0y5z0)
   added: (visited x0y5z0)
   changed: (battery-level) from 9 to 8
   goals met: 8 of 21
18. (decrease_y)
   changed: (y) from 5 to 4, (battery-level) from 8 to 7
   goals met: 8 of 21
19. (decrease_y)
   changed: (y) from 4 to 3, (battery-level) from 7 to 6
   goals met: 8 of 21
20. (decrease_y)
   changed: (y) from 3 to 2, (battery-level) from 6 to 5
   goals met: 8 of 21
21. (visit x0y2z0)
   added: (visited x0y2z0)
   changed: (battery-level) from 5 to 4
   goals met: 9 of 21
22. (decrease_y)
   changed: (y) from 2 to 1, (battery-level) from 4 to 3
   goals met: 9 of 21
23. (visit x0y1z0)
   added: (visited x0y1z0)
   changed: (battery-level) from 3 to 2
   goals met: 10 of 21
24. (decrease_y)
   changed: (y) from 1 to 0, (battery-level) from 2 to 1
   goals met: 11 of 21
25. (recharge)
   changed: (battery-level) from 1 to 25
   goals met: 11 of 21
26. (increase_y)
   changed: (y) from 0 to 1, (battery-level) from 25 to 24
   goals met: 10 of 21
27. (increase_y)
   changed: (y) from 1 to 2, (battery-level) from 24 to 23
   goals met: 10 of 21
28. (increase_y)
   changed: (y) from 2 to 3, (battery-level) from 23 to 22
   goals met: 10 of 21
29. (increase_y)
   changed: (y) from 3 to 4, (battery-level) from 22 to 21
   goals met: 10 of 21
30. (increase_y)
   changed: (y) from 4 to 5, (battery-level) from 21 to 20
   goals met: 10 of 21
31. (increase_y)
   changed: (y) from 5 to 6, (battery-level) from 20 to 19
   goals met: 10 of 21
32. (increase_x)
   changed: (x) from 0 to 1, (battery-level) from 19 to 18
   goals met: 9 of 21
33. (visit x1y6z0)
   added: (visited x1y6z0)
   changed: (battery-level) from 18 to 17
   goals met: 10 of 21
34. (decrease_x)
   changed: (x) from 1 to 0, (battery-level) from 17 to 16
   goals met: 11 of 21
35. (visit x0y6z0)
   added: (visited x0y6z0)
   changed: (battery-level) from 16 to 15
   goals met: 12 of 21
36. (increase_x)
   changed: (x) from 0 to 1, (battery-level) from 15 to 14
   goals met: 11 of 21
37. (decrease_y)
   changed: (y) from 6 to 5, (battery-level) from 14 to 13
   goals met: 11 of 21
38. (decrease_y)
   changed: (y) from 5 to 4, (battery-level) from 13 to 12
   goals met: 11 of 21
39. (decrease_y)
   changed: (y) from 4 to 3, (battery-level) from 12 to 11
   goals met: 11 of 21
40. (decrease_y)
   changed: (y) from 3 to 2, (battery-level) from 11 to 10
   goals met: 11 of 21
41. (visit x1y2z0)
   added: (visited x1y2z0)
   changed: (battery-level) from 10 to 9
   goals met: 12 of 21
42. (decrease_y)
   changed: (y) from 2 to 1, (battery-level) from 9 to 8
   goals met: 12 of 21
43. (visit x1y1z0)
   added: (visited x1y1z0)
   changed: (battery-level) from 8 to 7
   goals met: 13 of 21
44. (increase_y)
   changed: (y) from 1 to 2, (battery-level) from 7 to 6
   goals met: 13 of 21
45. (decrease_x)
   changed: (x) from 1 to 0, (battery-level) from 6 to 5
   goals met: 14 of 21
46. (visit x0y2z0)
   changed: (battery-level) from 5 to 4
   goals met: 14 of 21
47. (decrease_y)
   changed: (y) from 2 to 1, (battery-level) from 4 to 3
   goals met: 14 of 21
48. (decrease_y)
   changed: (y) from 1 to 0, (battery-level) from 3 to 2
   goals met: 15 of 21
49. (visit x0y0z0)
   added: (visited x0y0z0)
   changed: (battery-level) from 2 to 1
   goals met: 16 of 21
50. (recharge)
   changed: (battery-level) from 1 to 25
   goals met: 16 of 21
51. (increase_y)
   changed: (y) from 0 to 1, (battery-level) from 25 to 24
   goals met: 15 of 21
52. (increase_y)
   changed: (y) from 1 to 2, (battery-level) from 24 to 23
   goals met: 15 of 21
53. (increase_y)
   changed: (y) from 2 to 3, (battery-level) from 23 to 22
   goals met: 15 of 21
54. (increase_y)
   changed: (y) from 3 to 4, (battery-level) from 22 to 21
   goals met: 15 of 21
55. (increase_y)
   changed: (y) from 4 to 5, (battery-level) from 21 to 20
   goals met: 15 of 21
56. (increase_y)
   changed: (y) from 5 to 6, (battery-level) from 20 to 19
   goals met: 15 of 21
57. (increase_y)
   changed: (y) from 6 to 7, (battery-level) from 19 to 18
   goals met: 15 of 21
58. (visit x0y7z0)
   added: (visited x0y7z0)
   changed: (battery-level) from 18 to 17
   goals met: 16 of 21
59. (increase_x)
   changed: (x) from 0 to 1, (battery-level) from 17 to 16
   goals met: 15 of 21
60. (visit x1y7z0)
   added: (visited x1y7z0)
   changed: (battery-level) from 16 to 15
   goals met: 16 of 21
61. (increase_y)
   changed: (y) from 7 to 8, (battery-level) from 15 to 14
   goals met: 16 of 21
62. (visit x1y8z0)
   added: (visited x1y8z0)
   changed: (battery-level) from 14 to 13
   goals met: 17 of 21
63. (decrease_x)
   changed: (x) from 1 to 0, (battery-level) from 13 to 12
   goals met: 18 of 21
64. (decrease_y)
   changed: (y) from 8 to 7, (battery-level) from 12 to 11
   goals met: 18 of 21
65. (decrease_y)
   changed: (y) from 7 to 6, (battery-level) from 11 to 10
   goals met: 18 of 21
66. (decrease_y)
   changed: (y) from 6 to 5, (battery-level) from 10 to 9
   goals met: 18 of 21
67. (decrease_y)
   changed: (y) from 5 to 4, (battery-level) from 9 to 8
   goals met: 18 of 21
68. (decrease_y)
   changed: (y) from 4 to 3, (battery-level) from 8 to 7
   goals met: 18 of 21
69. (decrease_y)
   changed: (y) from 3 to 2, (battery-level) from 7 to 6
   goals met: 18 of 21
70. (decrease_y)
   changed: (y) from 2 to 1, (battery-level) from 6 to 5
   goals met: 18 of 21
71. (decrease_y)
   changed: (y) from 1 to 0, (battery-level) from 5 to 4
   goals met: 19 of 21
72. (recharge)
   changed: (battery-level) from 4 to 25
   goals met: 19 of 21
73. (visit x0y0z0)
   changed: (battery-level) from 25 to 24
   goals met: 19 of 21
74. (visit x0y0z0)
   changed: (battery-level) from 24 to 23
   goals met: 19 of 21
75. (visit x0y0z0)
   changed: (battery-level) from 23 to 22
   goals met: 19 of 21
76. (visit x0y0z0)
   changed: (battery-level) from 22 to 21
   goals met: 19 of 21
77. (visit x0y0z0)
   changed: (battery-level) from 21 to 20
   goals met: 19 of 21
78. (visit x0y0z0)
   changed: (battery-level) from 20 to 19
   goals met: 19 of 21
79. (visit x0y0z0)
   changed: (battery-level) from 19 to 18
   goals met: 19 of 21
80. (visit x0y0z0)
   changed: (battery-level) from 18 to 17
   goals met: 19 of 21
81. (visit x0y0z0)
   changed: (battery-level) from 17 to 16
   goals met: 19 of 21
82. (visit x0y0z0)
   changed: (battery-level) from 16 to 15
   goals met: 19 of 21
83. (visit x0y0z0)
   changed: (battery-level) from 15 to 14
   goals met: 19 of 21
84. (visit x0y0z0)
   changed: (battery-level) from 14 to 13
   goals met: 19 of 21
85. (visit x0y0z0)
   changed: (battery-level) from 13 to 12
   goals met: 19 of 21
86. (visit x0y0z0)
   changed: (battery-level) from 12 to 11
   goals met: 19 of 21
87. (visit x0y0z0)
   changed: (battery-level) from 11 to 10
   goals met: 19 of 21
88. (visit x0y0z0)
   changed: (battery-level) from 10 to 9
   goals met: 19 of 21
89. (visit x0y0z0)
   changed: (battery-level) from 9 to 8
   goals met: 19 of 21
90. (increase_x)
   changed: (x) from 0 to 1, (battery-level) from 8 to 7
   goals met: 18 of 21
91. (visit x1y0z0)
   added: (visited x1y0z0)
   changed: (battery-level) from 7 to 6
   goals met: 19 of 21
92. (decrease_x)
   changed: (x) from 1 to 0, (battery-level) from 6 to 5
   goals met: 20 of 21
93. (recharge)
   changed: (battery-level) from 5 to 25
   goals met: 20 of 21
94. (increase_y)
   changed: (y) from 0 to 1, (battery-level) from 25 to 24
   goals met: 19 of 21
95. (increase_y)
   changed: (y) from 1 to 2, (battery-level) from 24 to 23
   goals met: 19 of 21
96. (increase_y)
   changed: (y) from 2 to 3, (battery-level) from 23 to 22
   goals met: 19 of 21
97. (increase_y)
   changed: (y) from 3 to 4, (battery-level) from 22 to 21
   goals met: 19 of 21
98. (increase_y)
   changed: (y) from 4 to 5, (battery-level) from 21 to 20
   goals met: 19 of 21
99. (increase_y)
   changed: (y) from 5 to 6, (battery-level) from 20 to 19
   goals met: 19 of 21
100. (increase_y)
   changed: (y) from 6 to 7, (battery-level) from 19 to 18
   goals met: 19 of 21
101. (increase_y)
   changed: (y) from 7 to 8, (battery-level) from 18 to 17
   goals met: 19 of 21
102. (visit x0y8z0)
   added: (visited x0y8z0)
   changed: (battery-level) from 17 to 16
   goals met: 20 of 21
103. (decrease_y)
   changed: (y) from 8 to 7, (battery-level) from 16 to 15
   goals met: 20 of 21
104. (decrease_y)
   changed: (y) from 7 to 6, (battery-level) from 15 to 14
   goals met: 20 of 21
105. (decrease_y)
   changed: (y) from 6 to 5, (battery-level) from 14 to 13
   goals met: 20 of 21
106. (decrease_y)
   changed: (y) from 5 to 4, (battery-level) from 13 to 12
   goals met: 20 of 21
107. (decrease_y)
   changed: (y) from 4 to 3, (battery-level) from 12 to 11
   goals met: 20 of 21
108. (decrease_y)
   changed: (y) from 3 to 2, (battery-level) from 11 to 10
   goals met: 20 of 21
109. (decrease_y)
   changed: (y) from 2 to 1, (battery-level) from 10 to 9
   goals met: 20 of 21
110. (decrease_y)
   changed: (y) from 1 to 0, (battery-level) from 9 to 8
   goals met: 21 of 21
